from genuse.genuseyzs import *

color = {1:'红',2:'紫',3:'黄',4:'绿',5:'蓝',6:'银灰白',7:'黑'}
label1 = ['粉','粉红','红','玫红','深红','浅红','洋红','大红','枣红','桔红','橙红','酒红','火焰红','藕','浅粉']
label2 = ['紫','绛紫','蓝紫','淡紫','深紫','紫金檀','水晶紫']
label3 = ['黄','嫩黄','深黄','橙','橘','褐','深褐','棕','黄棕','深棕',
          '卡其','咖啡','金','黄绿','浅棕','琥珀金','香槟','灰棕','钛空金']
label4 = ['深绿','浅绿','青','草绿','墨绿','淡绿','绿','青绿']
label5 = ['深蓝','浅蓝','蓝','宝石蓝','军蓝','湖蓝','艳蓝','天蓝','深海蓝','晶钻蓝']
label6 = ['银','白','米白','灰','银灰','深灰','浅灰','银白','灰白','金属灰','灰银','乳白','铁灰','珍珠白','月光银','象牙白']
label7 = ['黑','碧玉黑']
head =['','','','我的车辆颜色','车颜色','颜色']
verb =['','','','是','应该是']
attribute =['','色','','色','','色','','色','颜色']
modal =['','','','的','的','的','啊']

if __name__ == "__main__":
    num_att = '红'
    patternlist = [head, verb, label1, attribute, modal]
    length = 1
    for i, item in enumerate(patternlist):
        print(len(item))
        length  = int(length)*len(item)
    u = Genuse(patternlist, 'color', 2, length,num_att)
    u.genneed()